{
  "backend/main.mo": "Main Motoko actor for the SmartAttend backend defining data types (Student, Teacher, Subject, etc.), in-memory sample data, access control, user profile management, and a login endpoint that assigns roles based on credentials.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: fixing the credential input in LoginPage.tsx to accept alphanumeric strings, and auditing useLogin.ts to correctly handle alphanumeric credential conversion before backend calls.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one- to two-sentence summaries of each frontend source file, serving as a reference index for the project's frontend components, pages, and hooks.",
  "frontend/index.html": "Root HTML entry point for the React app, mounting the app into a `#root` div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component managing authentication state (role and string credential) and conditionally rendering LoginPage, StudentDashboard, TeacherPanel, or AdminPanel based on the current role.",
  "frontend/src/components/CameraCapture.tsx": "Modal camera component that activates the device camera on mount, displays a live video preview, and captures a JPEG photo file for a named student upon user action.",
  "frontend/src/components/CodePlayground.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Empty file with no content.",
  "frontend/src/components/Header.tsx": "Empty file with no content.",
  "frontend/src/components/LanguageSelector.tsx": "Empty file with no content.",
  "frontend/src/components/LessonViewer.tsx": "Empty file with no content.",
  "frontend/src/components/LoginPrompt.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileSetup.tsx": "Empty file with no content.",
  "frontend/src/components/ProgressDashboard.tsx": "Empty file with no content.",
  "frontend/src/components/QuizViewer.tsx": "Empty file with no content.",
  "frontend/src/components/TutorialSection.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, reinitializing access control and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useGeolocation.ts": "Custom React hook wrapping the browser Geolocation API with loading/error states, a `fetchLocation` trigger, and a coordinate formatting utility.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions and status flags. Includes an InternetIdentityProvider component that persists identity across page reloads.",
  "frontend/src/hooks/useLogin.ts": "Defines a useLogin hook using React Query's useMutation that validates role-based credentials (student, teacher, admin) locally against hardcoded demo ID sets and returns a LoginResult.",
  "frontend/src/hooks/useQueries.ts": "Exports three React Query hooks (useAllSubjects, useSchoolSummary, useAllDepartments) that fetch data from the backend actor when it is available.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, imports the Inter font, and defines CSS custom properties for a navy/teal/white color palette in both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider into the root DOM element.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page displaying school-wide stats (students, teachers, subjects, attendance) with a bar chart of per-subject attendance and a department breakdown table, plus theme toggle and logout controls.",
  "frontend/src/pages/Dashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/LoginPage.tsx": "Login page component that lets users select a role (student, teacher, admin), enter a credential string, parses it to a bigint, and calls the useLogin hook, invoking onLoginSuccess on valid credentials.",
  "frontend/src/pages/RoleSelection.tsx": "Empty file with no content.",
  "frontend/src/pages/StudentDashboard.tsx": "Student dashboard page that looks up hardcoded per-student subject attendance data by normalized credential, displays an overall attendance percentage, and lists per-subject attendance with low-attendance warnings.",
  "frontend/src/pages/TeacherPanel.tsx": "React component for the Teacher Panel that allows teachers to mark student attendance (present/absent/late), capture photos via camera, and fetch geolocation on save. Includes hardcoded sample teacher and student data with credential normalization.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the SmartAttend frontend, extending the theme with OKLCH-based custom color palettes (navy, teal, and shadcn-style semantic tokens) and enabling dark mode via class strategy.",
  "project_state.json": "Project state manifest (version 9) describing SmartAttend's scope, architecture, existing features, and known issues, including a noted bug where the login input field blocks alphabetic credential entry."
}